tsung_client.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/usr/share/tsung/tsung-1.0.dtd">
<tsung version="1.0">
    <clients>
        <client host="localhost" use_controller_vm="true" maxusers="20001" />
    </clients>

    <servers>
        <server host="load-server.lambdaclass.com" port="6969" type="tcp" />
    </servers>

    <load duration="5" unit="minute">
        <arrivalphase phase="1" duration="5" unit="minute">
        	<users maxnumber="20000" arrivalrate="600" unit="second" />
    	</arrivalphase>
    </load>

    <options>
	    <option name="ports_range" min="1025" max="65535"/>
    </options>

    <sessions>
	    <session probability="100" name="raw" type="ts_raw">
            <request>
                <match do="continue" when="match">connected\n</match>
                <raw datasize="8" ack="local"></raw>
            </request>
 
            <for var="i" from="1" to="300" incr="1">
                <thinktime value="1" random="true" />
                <request>
                    <match do="continue" when="match">PONG\n</match>
                    <raw data="PING\n" ack="local"></raw>
                </request>
            </for>
	    </session>
    </sessions>
</tsung>